In [1]:
# d=pd.read_excel 불러오기 /// d.to_excel 저장
# d=pd.read_csv           /// d.to_csv
# d=pd.read_json         /// d.to_json
# d=pd.read_html        /// d.to_html

In [2]:
import pandas as pd
import numpy as np
names = ['둘리', '호이', '영미', '길동', '또치', '마이클']
scoresWithLectures = {'수학': [84, 21, 87, 100, 59, 46], \
                     '국어': [87, 84, 76, 100, 87, 99], \
                     '영어': [59,99,59,46,77,56]}
d = pd.DataFrame(scoresWithLectures, index = names)

In [3]:
# xlwt 모듈 필요
# d.to_excel('경로/파일명.xls', encoding = 'utf-8')  경로 안적으면 쥬피터폴더에 자동저장/ euc-kr

In [11]:
d.to_excel("C:/Users/deseo/AI ex Folder/data/example.xls", encoding = 'utf-8')

In [ ]:
d.to_excel("C:\\Users\\deseo\\AI ex Folder\\data\\example.xls", encoding = 'utf-8', index=False) 
# 인덱스제거후 저장 index=False

In [12]:
file = 'C:/Users/deseo/AI ex Folder/data/example.xls'
d0 = pd.read_excel(file, encoding = 'utf-8')
d0

    수학   국어  영어
0   84   87  59
1   21   84  99
2   87   76  59
3  100  100  46
4   59   87  77
5   46   99  56

In [13]:
file = 'C:/Users/deseo/AI ex Folder/data/example.xls'
d0 = pd.read_excel(file, encoding = 'utf-8', index_col = 0)  # 이거 넣으면 숫자 안붙음
d0

      국어  영어
수학
84    87  59
21    84  99
87    76  59
100  100  46
59    87  77
46    99  56

In [16]:
file = 'C:/Users/deseo/AI ex Folder/data/example.xls'
d0 = pd.read_excel(file, encoding = 'utf-8', usecols = [1,2])
d0

    국어  영어
0   87  59
1   84  99
2   76  59
3  100  46
4   87  77
5   99  56

In [17]:
file = 'C:/Users/deseo/AI ex Folder/data/example.xls'
d0 = pd.read_excel(file, encoding = 'utf-8', usecols = ['수학','국어'])
d0

    수학   국어
0   84   87
1   21   84
2   87   76
3  100  100
4   59   87
5   46   99

In [18]:
file = 'C:/Users/deseo/AI ex Folder/data/example.xls'
d0 = pd.read_excel(file, encoding = 'utf-8', index_col = 0, usecols = 'A, C:D', nrows = 4) 
#엑셀에 있는 틀의 A, B, C, D..... 를 체크하고 가져옴
d0

     영어
수학
84   59
21   99
87   59
100  46

In [15]:
file = 'C:/Users/deseo/AI ex Folder/data/example2.xls'
d1 = pd.read_excel(file, encoding = 'utf-8')
d1

    성적 Unnamed: 1 Unnamed: 2
0   수학         국어         영어
1   84         87         59
2   21         84         99
3   87         76         59
4  100        100         46
5   59         87         77
6   46         99         56

In [14]:
file = 'C:/Users/deseo/AI ex Folder/data/example2.xls'
d1 = pd.read_excel(file, encoding = 'utf-8', header = 1)   # 헤더 부분이 여러줄이면 꼭넣어야 에러 안생김
d1

    수학   국어  영어
0   84   87  59
1   21   84  99
2   87   76  59
3  100  100  46
4   59   87  77
5   46   99  56

In [31]:
file = 'C:/Users/deseo/AI ex Folder/data/example2.xls'
d1 = pd.read_excel(file, encoding = 'utf-8', header = [0,1]) #리스트 형식으로 적으면 위에 다 가져올수 있음
d1

    성적
    수학   국어  영어
0   84   87  59
1   21   84  99
2   87   76  59
3  100  100  46
4   59   87  77
5   46   99  56

In [21]:
d.to_csv("C:/Users/deseo/AI ex Folder/data/example.csv", encoding = 'euc-kr') 
# 엑셀에서도 잘 안깨지니 utf-8보다 euc-kr 써라...(csv의경우)

In [22]:
d.to_csv("C:/Users/deseo/AI ex Folder/data/example.csv", encoding = 'euc-kr', sep = '\t') 
# 콤마 말고 tap 방식적용

In [23]:
d.to_json("C:\\Users\\deseo\\AI ex Folder\\data\\ex_json.json")

In [25]:
d2 = pd.read_json("C:/Users/deseo/AI ex Folder/data/ex_json.json")
d2

      수학   국어  영어
길동   100  100  46
둘리    84   87  59
또치    59   87  77
마이클   46   99  56
영미    87   76  59
호이    21   84  99

In [26]:
d.to_html("C:/Users/deseo/AI ex Folder/data/example.html")

In [29]:
d3 = pd.read_html("C:/Users/deseo/AI ex Folder/data/example.html", encoding = 'euc-kr', index_col = 0)

In [30]:
d3[0]

      수학   국어  영어
둘리    84   87  59
호이    21   84  99
영미    87   76  59
길동   100  100  46
또치    59   87  77
마이클   46   99  56

In [32]:
names = ['둘리', '호이', '영미', '길동', '또치', '마이클']
scoresWithLectures = {'수학': [84, 21, 87, 100, 59, 46], \
'국어': [84, 15, 84, 87, 99, 77],\
'영어': [78, 84, 76, 99, 59, 59]}
d = pd.DataFrame(scoresWithLectures, index = names)
d

      수학  국어  영어
둘리    84  84  78
호이    21  15  84
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  59

In [39]:
for x in [d.sum, d.mean, d.median, d.var, d.std, d.max, d.min]:
    print(x())   # 기본값이 axis = 0 위에서 아래로 계산

수학    397
국어    446
영어    455
dtype: int64
수학    66.166667
국어    74.333333
영어    75.833333
dtype: float64
수학    71.5
국어    84.0
영어    77.0
dtype: float64
수학    878.966667
국어    896.666667
영어    234.966667
dtype: float64
수학    29.647372
국어    29.944393
영어    15.328622
dtype: float64
수학    100
국어     99
영어     99
dtype: int64
수학    21
국어    15
영어    59
dtype: int64

In [35]:
for x in [d.sum, d.mean, d.var, d.std, d.max, d.min]:
    print(x(axis = 1))   # 왼쪽에서 오른쪽으로 계산

둘리     246
호이     120
영미     247
길동     286
또치     217
마이클    182
dtype: int64
둘리     82.000000
호이     40.000000
영미     82.333333
길동     95.333333
또치     72.333333
마이클    60.666667
dtype: float64
둘리       12.000000
호이     1461.000000
영미       32.333333
길동       52.333333
또치      533.333333
마이클     242.333333
dtype: float64
둘리      3.464102
호이     38.223030
영미      5.686241
길동      7.234178
또치     23.094011
마이클    15.567059
dtype: float64
둘리      84
호이      84
영미      87
길동     100
또치      99
마이클     77
dtype: int64
둘리     78
호이     15
영미     76
길동     87
또치     59
마이클    46
dtype: int64

In [36]:
d['수학'].mean()

66.16666666666667

In [38]:
d.iloc[2].sum()

247

In [40]:
d.corr()    # 연관이 있으면 절대값 1에 가깝게 -1부터 1까지

          수학        국어        영어
수학  1.000000  0.732545  0.403635
국어  0.732545  1.000000 -0.273925
영어  0.403635 -0.273925  1.000000

In [41]:
d[['국어','영어']].corr()

          국어        영어
국어  1.000000 -0.273925
영어 -0.273925  1.000000

In [52]:
d['물리'] = d['수학'] + np.random.randint(-10, 10, 6)  #물리나 생물은 수학이랑 연관있으니 이렇게 값을 넣음
d['생물'] = d['수학'] + np.random.randint(-40, 40, 6)

In [54]:
d[d<0] = 0     # 음수인 랜덤값을 0으로 바꿈

In [55]:
d.corr()

          수학        국어        영어        물리        생물
수학  1.000000  0.732545  0.403635  0.973266  0.596060
국어  0.732545  1.000000 -0.273925  0.735954  0.262823
영어  0.403635 -0.273925  1.000000  0.426284  0.245516
물리  0.973266  0.735954  0.426284  1.000000  0.488166
생물  0.596060  0.262823  0.245516  0.488166  1.000000

In [58]:
names = ['둘리', '호이', '영미', '길동', '또치', '마이클']
scoresWithLectures = {'수학': [84, 21, 87, 100, 59, 46], \
'국어': [84, 15, 84, 87, 99, 77],\
'영어': [78, 84, 76, 99, 59, 59]}
d = pd.DataFrame(scoresWithLectures, index = names)
d

      수학  국어  영어
둘리    84  84  78
호이    21  15  84
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  59

In [60]:
d.loc['길동', '수학'] = float('NaN')
d.loc['호이', '영어'] = float('NaN')
d.loc['또치', ['수학', '국어']] = float('NaN')
d['컴퓨터'] = pd.Series()
d

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  NaN
호이   21.0  15.0   NaN  NaN
영미   87.0  84.0  76.0  NaN
길동    NaN  87.0  99.0  NaN
또치    NaN   NaN  59.0  NaN
마이클  46.0  77.0  59.0  NaN

In [61]:
d.isnull()

        수학     국어     영어   컴퓨터
둘리   False  False  False  True
호이   False  False   True  True
영미   False  False  False  True
길동    True  False  False  True
또치    True   True  False  True
마이클  False  False  False  True

In [62]:
d.notnull()

        수학     국어     영어    컴퓨터
둘리    True   True   True  False
호이    True   True  False  False
영미    True   True   True  False
길동   False   True   True  False
또치   False  False   True  False
마이클   True   True   True  False

In [66]:
d[d.isnull()] = 0

In [67]:
d

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  0.0
호이   21.0  15.0   0.0  0.0
영미   87.0  84.0  76.0  0.0
길동    0.0  87.0  99.0  0.0
또치    0.0   0.0  59.0  0.0
마이클  46.0  77.0  59.0  0.0

In [68]:
d.loc['길동', '수학'] = float('NaN')
d.loc['호이', '영어'] = float('NaN')
d.loc['또치', ['수학', '국어']] = float('NaN')
d['컴퓨터'] = pd.Series()
d

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  NaN
호이   21.0  15.0   NaN  NaN
영미   87.0  84.0  76.0  NaN
길동    NaN  87.0  99.0  NaN
또치    NaN   NaN  59.0  NaN
마이클  46.0  77.0  59.0  NaN

In [69]:
# 'any': NaN이 하나라도 있으면 제거
# 'all': NaN으로 모두 채워져 있을 경우 제거

In [70]:
# d.dropna(how = 'any')
# d.dropna(how = 'all')
# d.dropna(how = 'any', axis = 1)
# d.dropna(how = 'all', axis = 1)
# d.dropna(subset = ['수학', '국어'], how = 'any')
# d.dropna(subset = ['수학', '국어'], how = 'all')
d.dropna(subset = ['길동', '또치'], how = 'all', axis = 1)  # 길동 또치의 값 중 두사람다 널인것이 지워짐
# d.dropna(subset = ['길동', '또치'], how = 'any', axis = 1)

       국어    영어
둘리   84.0  78.0
호이   15.0   NaN
영미   84.0  76.0
길동   87.0  99.0
또치    NaN  59.0
마이클  77.0  59.0

In [85]:
names = ['둘리', '호이', '영미', '길동', '또치', '마이클']
scoresWithLectures = {'수학': [84, 21, 87, 100, 59, 46], \
'국어': [84, 15, 84, 87, 99, 77],\
'영어': [78, 84, 76, 99, 59, 59]}
d = pd.DataFrame(scoresWithLectures, index = names)
d

      수학  국어  영어
둘리    84  84  78
호이    21  15  84
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  59

In [86]:
d.loc['길동', '수학'] = float('NaN')
d.loc['호이', '영어'] = float('NaN')
d.loc['또치', ['수학', '국어']] = float('NaN')
d['컴퓨터'] = pd.Series()
d

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  NaN
호이   21.0  15.0   NaN  NaN
영미   87.0  84.0  76.0  NaN
길동    NaN  87.0  99.0  NaN
또치    NaN   NaN  59.0  NaN
마이클  46.0  77.0  59.0  NaN

In [73]:
d.fillna(0)                       # inplace = True 로 설정하여야만 원본에 반영

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  0.0
호이   21.0  15.0   0.0  0.0
영미   87.0  84.0  76.0  0.0
길동    0.0  87.0  99.0  0.0
또치    0.0   0.0  59.0  0.0
마이클  46.0  77.0  59.0  0.0

In [74]:
d.fillna(d.mean().mean())

       수학    국어    영어   컴퓨터
둘리   84.0  84.0  78.0  67.7
호이   21.0  15.0  67.7  67.7
영미   87.0  84.0  76.0  67.7
길동   67.7  87.0  99.0  67.7
또치   67.7  67.7  59.0  67.7
마이클  46.0  77.0  59.0  67.7

In [75]:
print(d.mean())                      # inplace = True 를 안했기 때문에 다시 NaN
d.fillna(d.mean())

수학     59.5
국어     69.4
영어     74.2
컴퓨터     NaN
dtype: float64

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  NaN
호이   21.0  15.0  74.2  NaN
영미   87.0  84.0  76.0  NaN
길동   59.5  87.0  99.0  NaN
또치   59.5  69.4  59.0  NaN
마이클  46.0  77.0  59.0  NaN

In [76]:
print(d.min())
d.fillna(d.min())

수학     21.0
국어     15.0
영어     59.0
컴퓨터     NaN
dtype: float64

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  NaN
호이   21.0  15.0  59.0  NaN
영미   87.0  84.0  76.0  NaN
길동   21.0  87.0  99.0  NaN
또치   21.0  15.0  59.0  NaN
마이클  46.0  77.0  59.0  NaN

In [77]:
d['컴퓨터'].fillna(d.mean(axis = 1))     # 한열씩만 채울수 있으니 다 채울려면 for문 사용

둘리     82.000000
호이     18.000000
영미     82.333333
길동     93.000000
또치     59.000000
마이클    60.666667
Name: 컴퓨터, dtype: float64

In [87]:
d

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  NaN
호이   21.0  15.0   NaN  NaN
영미   87.0  84.0  76.0  NaN
길동    NaN  87.0  99.0  NaN
또치    NaN   NaN  59.0  NaN
마이클  46.0  77.0  59.0  NaN

In [82]:
d.loc['슬기'] = d.loc['둘리']    # 둘리값을 복사해서 슬기에 넣어서 추가
d

       수학    국어    영어  컴퓨터
둘리   84.0  84.0  78.0  NaN
호이   21.0  15.0   NaN  NaN
영미   87.0  84.0  76.0  NaN
길동    NaN  87.0  99.0  NaN
또치    NaN   NaN  59.0  NaN
마이클  46.0  77.0  59.0  NaN
슬기   84.0  84.0  78.0  NaN

In [83]:
d.duplicated()      # 처음 같은 값은 상관없으나 두번째 같은 값 나오면 중복이라 True로 나옴

둘리     False
호이     False
영미     False
길동     False
또치     False
마이클    False
슬기      True
dtype: bool

In [84]:
d['영어'].duplicated()

둘리     False
호이     False
영미     False
길동     False
또치     False
마이클     True
슬기      True
Name: 영어, dtype: bool

In [88]:
del d['컴퓨터']
d.loc['슬기'] = d.loc['마이클']
d.duplicated()

둘리     False
호이     False
영미     False
길동     False
또치     False
마이클    False
슬기      True
dtype: bool

In [89]:
d

       수학    국어    영어
둘리   84.0  84.0  78.0
호이   21.0  15.0   NaN
영미   87.0  84.0  76.0
길동    NaN  87.0  99.0
또치    NaN   NaN  59.0
마이클  46.0  77.0  59.0
슬기   46.0  77.0  59.0

In [90]:
d.duplicated()

둘리     False
호이     False
영미     False
길동     False
또치     False
마이클    False
슬기      True
dtype: bool

In [91]:
d['영어'].duplicated()

둘리     False
호이     False
영미     False
길동     False
또치     False
마이클     True
슬기      True
Name: 영어, dtype: bool

In [92]:
d.drop_duplicates()     # 중복 데이터 제거 (결국 위에 true로 나온값들이 사라진다고 보면됨)

       수학    국어    영어
둘리   84.0  84.0  78.0
호이   21.0  15.0   NaN
영미   87.0  84.0  76.0
길동    NaN  87.0  99.0
또치    NaN   NaN  59.0
마이클  46.0  77.0  59.0

In [93]:
d.drop_duplicates(subset = '영어')

      수학    국어    영어
둘리  84.0  84.0  78.0
호이  21.0  15.0   NaN
영미  87.0  84.0  76.0
길동   NaN  87.0  99.0
또치   NaN   NaN  59.0

In [94]:
d.drop_duplicates(subset = ['영어', '수학'])

       수학    국어    영어
둘리   84.0  84.0  78.0
호이   21.0  15.0   NaN
영미   87.0  84.0  76.0
길동    NaN  87.0  99.0
또치    NaN   NaN  59.0
마이클  46.0  77.0  59.0

In [98]:
import pandas as pd
names = ['둘리', '호이', '영미', '길동']
info = {'생년월일': ['1953-02-01', '3/1/1984', '2001-1-4', '2011-12-31'],\
    '점수': [84, 15, 84, 87]}
d = pd.DataFrame(info, index = names)
d

          생년월일  점수
둘리  1953-02-01  84
호이    3/1/1984  15
영미    2001-1-4  84
길동  2011-12-31  87

In [99]:
d['생년월일']

둘리    1953-02-01
호이      3/1/1984
영미      2001-1-4
길동    2011-12-31
Name: 생년월일, dtype: object

In [100]:
d['생년월일'] = pd.to_datetime(d['생년월일'])
d

         생년월일  점수
둘리 1953-02-01  84
호이 1984-03-01  15
영미 2001-01-04  84
길동 2011-12-31  87

In [101]:
d['생년월일']

둘리   1953-02-01
호이   1984-03-01
영미   2001-01-04
길동   2011-12-31
Name: 생년월일, dtype: datetime64[ns]

In [102]:
d['Y'] = d['생년월일'].dt.year                 # 위에는 연, 월, 일 하나씩 이지만 아래는 아님
d['M'] = d['생년월일'].dt.month
d['D'] = d['생년월일'].dt.day
d

         생년월일  점수     Y   M   D
둘리 1953-02-01  84  1953   2   1
호이 1984-03-01  15  1984   3   1
영미 2001-01-04  84  2001   1   4
길동 2011-12-31  87  2011  12  31

In [103]:
d.set_index('생년월일', inplace = True)       
d['연'] = d.index.to_period(freq='A')
d['연월'] = d.index.to_period(freq='M')
d['연월일'] = d.index.to_period(freq='D')
d

            점수     Y   M   D     연       연월         연월일
생년월일
1953-02-01  84  1953   2   1  1953  1953-02  1953-02-01
1984-03-01  15  1984   3   1  1984  1984-03  1984-03-01
2001-01-04  84  2001   1   4  2001  2001-01  2001-01-04
2011-12-31  87  2011  12  31  2011  2011-12  2011-12-31

In [104]:
pd.date_range(start='2019-9-25', periods = 6, freq = 'M')   # periods 기간

DatetimeIndex(['2019-09-30', '2019-10-31', '2019-11-30', '2019-12-31',
               '2020-01-31', '2020-02-29'],
              dtype='datetime64[ns]', freq='M')

In [105]:
pd.date_range(start='2019-9-25', periods = 6, freq = 'MS')  # 월의 시작으로만 하겠다. s 는 start

DatetimeIndex(['2019-10-01', '2019-11-01', '2019-12-01', '2020-01-01',
               '2020-02-01', '2020-03-01'],
              dtype='datetime64[ns]', freq='MS')

In [106]:
pd.date_range(start='2019-9-25', periods = 6, freq = '2D') # 이틀씩 건너뜀 2d

DatetimeIndex(['2019-09-25', '2019-09-27', '2019-09-29', '2019-10-01',
               '2019-10-03', '2019-10-05'],
              dtype='datetime64[ns]', freq='2D')

In [107]:
pd.date_range(start='2019-9-25', end = '2025-9-25', freq = 'YS')  # 연의 시작으로만 하겠다.s 는 start

DatetimeIndex(['2020-01-01', '2021-01-01', '2022-01-01', '2023-01-01',
               '2024-01-01', '2025-01-01'],
              dtype='datetime64[ns]', freq='AS-JAN')

In [108]:
pd.period_range(start='2019-9-25', periods = 6, freq = 'Y')     # 필요한 시간 정보만 포함

PeriodIndex(['2019', '2020', '2021', '2022', '2023', '2024'], dtype='period[A-DEC]', freq='A-DEC')

In [109]:
pd.period_range(start='2019-9-25', periods = 6, freq = 'M')

PeriodIndex(['2019-09', '2019-10', '2019-11', '2019-12', '2020-01', '2020-02'], dtype='period[M]', freq='M')

In [110]:
pd.period_range(start='2019-9-25', periods = 6, freq = 'D')

PeriodIndex(['2019-09-25', '2019-09-26', '2019-09-27', '2019-09-28',
             '2019-09-29', '2019-09-30'],
            dtype='period[D]', freq='D')

In [111]:
pd.period_range(start='2019-9-25', end = '2025-9-25', freq = 'Y')

PeriodIndex(['2019', '2020', '2021', '2022', '2023', '2024', '2025'], dtype='period[A-DEC]', freq='A-DEC')